<?php
function semantic($i,&$words,&$fem,$f)
{
	$_1_2[1]="одна ";
	$_1_2[2]="две ";

	$_1_19[1]="один ";
	$_1_19[2]="два ";
	$_1_19[3]="три ";
	$_1_19[4]="четыре ";
	$_1_19[5]="п€ть ";
	$_1_19[6]="шесть ";
	$_1_19[7]="семь ";
	$_1_19[8]="восемь ";
	$_1_19[9]="дев€ть ";
	$_1_19[10]="дес€ть ";

	$_1_19[11]="одиннацать ";
	$_1_19[12]="двенадцать ";
	$_1_19[13]="тринадцать ";
	$_1_19[14]="четырнадцать ";
	$_1_19[15]="п€тнадцать ";
	$_1_19[16]="шестнадцать ";
	$_1_19[17]="семнадцать ";
	$_1_19[18]="восемнадцать ";
	$_1_19[19]="дев€тнадцать ";

	$des[2]="двадцать ";
	$des[3]="тридцать ";
	$des[4]="сорок ";
	$des[5]="п€тьдес€т ";
	$des[6]="шестьдес€т ";
	$des[7]="семьдес€т ";
	$des[8]="восемдес€т ";
	$des[9]="дев€носто ";

	$hang[1]="сто ";
	$hang[2]="двести ";
	$hang[3]="триста ";
	$hang[4]="четыреста ";
	$hang[5]="п€тьсот ";
	$hang[6]="шестьсот ";
	$hang[7]="семьсот ";
	$hang[8]="восемьсот ";
	$hang[9]="дев€тьсот ";

	$words="";
	$fl=0;
	if($i >= 100)
	{
		$jkl = intval($i / 100);
		$words.=$hang[$jkl];
		$i%=100;
	}
	if($i >= 20)
	{
		$jkl = intval($i / 10);
		$words.=$des[$jkl];
		$i%=10;
		$fl=1;
	}
	switch($i)
	{
		case 1: $fem=1; break;
		case 2:
		case 3:
		case 4: $fem=2; break;
		default: $fem=3; break;
	}
	if( $i )
	{
		if( $i < 3 && $f > 0 )
		{
			if ( $f >= 2 )
			{
				$words.=$_1_19[$i];
			}
			else
			{
				$words.=$_1_2[$i];
			}
		}
		else
		{
			$words.=$_1_19[$i];
		}
	}
}


function num2str($L)
{
	$namerub[1]="рубль ";
	$namerub[2]="рубл€ ";
	$namerub[3]="рублей ";

	$nametho[1]="тыс€ча ";
	$nametho[2]="тыс€чи ";
	$nametho[3]="тыс€ч ";

	$namemil[1]="миллион ";
	$namemil[2]="миллиона ";
	$namemil[3]="миллионов ";

	$namemrd[1]="миллиард ";
	$namemrd[2]="миллиарда ";
	$namemrd[3]="миллиардов ";

	$kopeek[1]="копейка ";
	$kopeek[2]="копейки ";
	$kopeek[3]="копеек ";

	$s=" ";
	$s1=" ";
	$s2=" ";
	$kop=intval( ( $L*100 - intval( $L )*100 ));
	$L=intval($L);
	if($L>=1000000000)
	{
		$many=0;
		semantic(intval($L / 1000000000),$s1,$many,3);
		$s.=$s1.$namemrd[$many];
		$L%=1000000000;
	}

	if($L >= 1000000)
	{
		$many=0;
		semantic(intval($L / 1000000),$s1,$many,2);
		$s.=$s1.$namemil[$many];
		$L%=1000000;
		if($L==0)
		{
			$s.="рублей ";
		}
	}

	if($L >= 1000)
	{
		$many=0;
		semantic(intval($L / 1000),$s1,$many,1);
		$s.=$s1.$nametho[$many];
		$L%=1000;
		if($L==0)
		{
			$s.="рублей ";
		}
	}

	if($L != 0)
	{
		$many=0;
		semantic($L,$s1,$many,0);
		$s.=$s1.$namerub[$many];
	}

	if($kop > 0)
	{
		$many=0;
		semantic($kop,$s1,$many,1);
		$s.=$s1.$kopeek[$many];
	}
	else
	{
		$s.=" 00 копеек";
	}

// ƒоработка строки (пробелы, перва€ заглавна€)
	$s = trim($s);
	while( substr_count($s, "  ") )
	{
		$s = str_replace("  ", " ", $s);
	}
	return substr_replace($s, strtoupper(substr($s, 0, 1)), 0, 1);
}
?>
